tests/doctor/slotBooking/stress/artillery-slot-management-stress.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 30
      name: "Slot management stress test"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Rapid Slot Status Changes"
    flow:
      - post:
          url: "/auth/login"
          json:
            email: "doctor{{ $randomInt(0, 4) }}@example.com"
            password: "password123"
          capture:
            json: "$.data.tokens.accessToken"
            as: "token"
      - get:
          url: "/doctor/slots"
          headers:
            Authorization: "Bearer {{ token }}"
          qs:
            status: "available"
            limit: 1
          capture:
            json: "$.data.slots[0]._id"
            as: "slotId"
      - put:
          url: "/doctor/slots/{{ slotId }}/status"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            action: "block"
            reason: "Rapid block test {{ $randomInt }}"
          expect:
            - statusCode: 200
      - put:
          url: "/doctor/slots/{{ slotId }}/status"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            action: "unblock"
          expect:
            - statusCode: 200